const skillsData = [
    {
        title: "Vue.js",
        img: "vue.svg",
        level: 60,
        descr: "JavaScript-фреймворк с открытым исходным кодом для создания пользовательских интерфейсов. Легко интегрируется в проекты с использованием других JavaScript-библиотек. Может функционировать как веб-фреймворк для разработки одностраничных приложений в реактивном стиле.",
        path: 7
    },
    {
        title: "React JS",
        img: "react.svg",
        level: 60,
        descr: "JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов. React разрабатывается и поддерживается Facebook, Instagram и сообществом отдельных разработчиков и корпораций. React может использоваться для разработки одностраничных и мобильных приложений. Его цель — предоставить высокую скорость, простоту и масштабируемость.",
        path: 1
    },
    {
        title: "Redux",
        img: "redux.svg",
        level: 30,
        descr: "Redux — библиотека для JavaScript с открытым исходным кодом, предназначенная для управления состоянием приложения. Чаще всего используется в связке с React или Angular для разработки клиентской части. Содержит ряд инструментов, позволяющих значительно упростить передачу данных хранилища через контекст.",
        path: 2
    },
    {
        title: "JavaScript",
        img: "js.svg",
        level: 80,
        descr: "Мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией стандарта ECMAScript. JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений. Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам.",
        path: 3
    },
    {
        title: "TypeScript",
        img: "typescript.svg",
        level: 20,
        descr: "TypeScript — это расширенная версия JavaScript, главной целью которого является упрощение разработки крупных JS-приложений. Этот язык добавляет много новых принципов — классы, дженерики, интерфейсы, статические типы, что значительно упрощает разработку.",
        path: 4
    },
    {
        title: "HTML5",
        img: "html.svg",
        level: 70,
        descr: "Стандартизированный язык разметки документов во Всемирной паутине. Большинство веб-страниц содержат описание разметки на языке HTML. Язык HTML интерпретируется браузерами; полученный в результате интерпретации форматированный текст отображается на экране монитора компьютера или мобильного устройства.",
        path: 5
    },
    {
        title: "Sass",
        img: "sass.svg",
        level: 40,
        descr: "Метаязык на основе CSS, предназначенный для увеличения уровня абстракции CSS кода и упрощения файлов каскадных таблиц стилей. Язык Sass имеет два синтаксиса: 1) sass — отличается отсутствием фигурных скобок, в нём вложенные элементы реализованы с помощью отступов; 2) SCSS (Sassy CSS) — использует фигурные скобки, как и сам CSS.",
        path: 6
    },
    
]

export default skillsData